{
  "education": [
    {
      "awards_achievements": null,
      "degree": "MEng in Electrical and Computer Engineering",
      "department": "Electrical and Computer Engineering",
      "duration": "2019-2020",
      "school_name": "University of Waterloo"
    },
    {
      "awards_achievements": null,
      "degree": "MS in Computer System and Knowledge Engineering",
      "department": "Electronics and Computer Engineering",
      "duration": "2014-2016",
      "school_name": "Tribhuvan University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_ShambhabiPoudyal",
  "highlighted_projects": [
    {
      "description": "Implemented cascaded CNN model to detect license plate with high accuracy and speed. Used holistic CNN structure for recognition of detected license plates. Obtained an overall accuracy of 98% on CCPD parking dataset containing wide variety of license plates. Experimented with a total of 250k images. Used Google Colab, Python, NumPy, SciPy, TensorFlow, Keras, Pandas, Matplotlib, PyPlot",
      "git_url": "",
      "name": "License Plate Detection and Recognition using Joint CNNs"
    },
    {
      "description": "Designed a multi-threaded Linux program to find the minimum number of street camera locations needed to achieve full coverage of a network of roads for traffic management. Visualized this as minimum vertex cover problem and solved using MiniSat solver library. Used C++, Python, MiniSAT solver, Git, CMake, Linux POSIX threads.",
      "git_url": null,
      "name": "Minimum Vertex Cover for Street Camera Deployment"
    },
    {
      "description": "Implemented machine learning techniques to extract features of images from the dataset and classify them. Compared results of various classifier algorithms to identify the best suited classifier for the dataset. Designed using Python in Google Colab, compared results in Kaggle.",
      "git_url": null,
      "name": "Feature Extraction and Classification on Fashion MNIST Image Dataset"
    },
    {
      "description": "Developed image processing model to locate a book of interest in a library setup. Used SIFT, SURF, and ORB feature detection algorithms to find a match of the requested book to recommend precise location in the library. Designed using Image Processing Toolbox in Matlab.",
      "git_url": null,
      "name": "Object Detection Using Sliding Window for Locating Books in a Library"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Designed a Linux Cluster Administration (LCA) system to manage a cluster of nodes running in CentOS 7 and monitor the resource usage. Calculated hardware specifications and usage data of each node in a RDBMS database that can be used for future references. Used a VM instance created in GCP connected via SSH. Implemented using docker engine and Postgresql with bash scripting.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App:",
        "JDBC App: ",
        "Grep App: "
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "Not started",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Shambhabi Poudyal",
  "others": [
    {
      "bullets": [
        "Conference Paper Presenter",
        "Electrical Project Coordinator"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis Consulting Group",
      "description": "Developed software projects in Java using bash scripting. Designed Linux Clustering Agent software for monitoring system resource usage. Designed a trading platform REST API in Java.",
      "duration": "2021-present",
      "title": "Junior Developer"
    },
    {
      "company": "Nepal Electricity Authority, Nepal",
      "description": "Examined energy transmission sub-station hardware and equipment's software to identify issues and solved them. Programmed and Tested sub-station systems energy meters and relays. Evaluated and Analyzed bids offered for sub-station projects through competitive bidding.",
      "duration": "2014-2019",
      "title": "Electronics Engineer"
    },
    {
      "company": "Advanced College of Engineering and Management, Nepal",
      "description": "Conducted engineering undergraduate laboratory classes for C and C++ Programming and Microprocessor. Supervised undergraduate projects: 'GSM Based Home Automation System', 'RFID Based Vehicle Tracking and Registration System' ",
      "duration": "2012-2014",
      "title": "Lab Instructor"
    }
  ],
  "skills": {
    "competent": [
      "Python",
      "Deep Learning Python Packages",
      "C/C++",
      "MATLAB",
      "(to be added)"
    ],
    "familiar": [
      "R",
      "GCP",
      "Docker",
      "Google Colab",
      "SPSS",
      "Kaggle",
      "MiniSat solver"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "Dedicated recent graduate with specialization in AI and Machine Learning who is passionate about problem solving. Seeking an opportunity to apply and expand my data exploration and data analysis skills as a Data Engineering Practitioner."
}
